# 1)Напишите код, который спрашивает имя и фамилию пользователя. 
# Сделайте так чтоб на экран вышла первая буква имени,  точка и фамилия полностью  с приветствием.
lastname=input("Введите свою фамилию:")
name=input("Введите имя:")
print('Здравствуйте мы рады вам, '+lastname+' '+ name[0]+'.')
