# Задача вашей программы вывести на экран  все символы в данной строке в верхнем регистре.
str='abcdef'
print('Было <<'+str+'>>')
print('Результат после перевода строки в верхний регистр <<'+str.upper()+'>>') 