# Найдите периметр(p) и площадь(s) квадрата , попросив пользователя ввести длину стороны квадрата. 
a=int(input('Введите длину сторон квадрата:'))
P=a+a+a+a
print('Периметр квадрата ='+str(P))
S=a*a
print('Площадь квадрата ='+str(S))