# Входные данные Дана строка.
#  Выходные данные:
# Сначала выведите третий символ этой строки.
# Во второй строке выведите предпоследний символ этой строки.
# В третьей строке выведите первые пять символов этой строки.
# В четвертой строке выведите всю строку, кроме последних двух символов.
# В пятой строке выведите все символы с четными индексами (считая, что индексация начинается с 0, поэтому символы выводятся начиная с первого).
# В шестой строке выведите длину данной строки.


str1='Lorem ipsum dolor  sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua.'
print(str1)
print('Третий символ строки:'+str1[2])
print('Предпоследний символ строки:'+str1[-2])
print('Первые пять символов строки:'+str1[0:5])
print('Вся строка, кроме последних двух символов:'+str1[0:-2])
print('Четные индексы:'+str1[2::2])
print('Количество символов в данном тексте:'+str(len(str1)))