# Таможная служба  КР попросила сделать вас программу, которая автоматически добавляет 
# НДС(p) и площадь(s) квадрата , попросив пользователя ввести длину 12%) в стоимость товара, который импортируется в нашу страну. Ваша задача 
# попросить вести цену товара у работника таможни и автоматически выводить стоимость с НДСом.

price=int(input('Введите цену товара:'))
nds=((price/100)*12)
newprice=nds+price
print('НДС(12%) для данной стоимости товара составляет '+str(nds)+' coм')
print('Стоимость товара с учетом НДС = '+str(newprice)+' сом')